#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/khaireeorg/gh-actions-demo/runs/run-rmcDs5ppq28AdxhN

Waiting for the plan to start...

Terraform v1.0.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_pet.lambda_bucket_name: Refreshing state... [id=random-prefix-amazingly-amazingly-big-terrapin]
aws_apigatewayv2_route.post_route: Refreshing state... [id=0tef61g]
aws_apigatewayv2_integration.api_gw_integration: Refreshing state... [id=lhsqgkl]
aws_apigatewayv2_route.get_route: Refreshing state... [id=umutrx7]
aws_s3_bucket_object.lambda_source_bucket_object: Refreshing state... [id=lambda_source_code.zip]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_api.lambda: Refreshing state... [id=n1kkxr4nxe]
aws_lambda_function.lambda_function: Refreshing state... [id=test_task_lambda_function]
aws_s3_bucket.lambda_source_bucket: Refreshing state... [id=random-prefix-amazingly-amazingly-big-terrapin]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20210811195126450100000001]
aws_cloudwatch_log_group.cloudwatch_log_group: Refreshing state... [id=/aws/lambda/test_task_lambda_function]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_apigatewayv2_stage.lambda has been changed
  ~ resource "aws_apigatewayv2_stage" "lambda" {
      ~ deployment_id   = "77j512" -> "1000m7"
        id              = "serverless_lambda_stage"
        name            = "serverless_lambda_stage"
        tags            = {}
        # (7 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_apigatewayv2_api.lambda will be destroyed
  - resource "aws_apigatewayv2_api" "lambda" {
      - api_endpoint                 = "https://n1kkxr4nxe.execute-api.us-east-1.amazonaws.com" -> null
      - api_key_selection_expression = "$request.header.x-api-key" -> null
      - arn                          = "arn:aws:apigateway:us-east-1::/apis/n1kkxr4nxe" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:us-east-1:183400094533:n1kkxr4nxe" -> null
      - id                           = "n1kkxr4nxe" -> null
      - name                         = "serverless_lambda_gw" -> null
      - protocol_type                = "HTTP" -> null
      - route_selection_expression   = "$request.method $request.path" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null
    }

  # aws_apigatewayv2_integration.api_gw_integration will be destroyed
  - resource "aws_apigatewayv2_integration" "api_gw_integration" {
      - api_id                 = "n1kkxr4nxe" -> null
      - connection_type        = "INTERNET" -> null
      - id                     = "lhsqgkl" -> null
      - integration_method     = "POST" -> null
      - integration_type       = "AWS_PROXY" -> null
      - integration_uri        = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:183400094533:function:test_task_lambda_function/invocations" -> null
      - payload_format_version = "1.0" -> null
      - request_parameters     = {} -> null
      - request_templates      = {} -> null
      - timeout_milliseconds   = 30000 -> null
    }

  # aws_apigatewayv2_route.get_route will be destroyed
  - resource "aws_apigatewayv2_route" "get_route" {
      - api_id               = "n1kkxr4nxe" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "NONE" -> null
      - id                   = "umutrx7" -> null
      - request_models       = {} -> null
      - route_key            = "GET /api" -> null
      - target               = "integrations/lhsqgkl" -> null
    }

  # aws_apigatewayv2_route.post_route will be destroyed
  - resource "aws_apigatewayv2_route" "post_route" {
      - api_id               = "n1kkxr4nxe" -> null
      - api_key_required     = false -> null
      - authorization_scopes = [] -> null
      - authorization_type   = "NONE" -> null
      - id                   = "0tef61g" -> null
      - request_models       = {} -> null
      - route_key            = "POST /api" -> null
      - target               = "integrations/lhsqgkl" -> null
    }

  # aws_apigatewayv2_stage.lambda will be destroyed
  - resource "aws_apigatewayv2_stage" "lambda" {
      - api_id          = "n1kkxr4nxe" -> null
      - arn             = "arn:aws:apigateway:us-east-1::/apis/n1kkxr4nxe/stages/serverless_lambda_stage" -> null
      - auto_deploy     = true -> null
      - deployment_id   = "1000m7" -> null
      - execution_arn   = "arn:aws:execute-api:us-east-1:183400094533:n1kkxr4nxe/serverless_lambda_stage" -> null
      - id              = "serverless_lambda_stage" -> null
      - invoke_url      = "https://n1kkxr4nxe.execute-api.us-east-1.amazonaws.com/serverless_lambda_stage" -> null
      - name            = "serverless_lambda_stage" -> null
      - stage_variables = {} -> null
      - tags            = {} -> null
      - tags_all        = {} -> null

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-east-1:183400094533:log-group:/aws/api_gw/serverless_lambda_gw" -> null
          - format          = jsonencode(
                {
                  - httpMethod              = "$context.httpMethod"
                  - integrationErrorMessage = "$context.integrationErrorMessage"
                  - protocol                = "$context.protocol"
                  - requestId               = "$context.requestId"
                  - requestTime             = "$context.requestTime"
                  - resourcePath            = "$context.resourcePath"
                  - responseLength          = "$context.responseLength"
                  - routeKey                = "$context.routeKey"
                  - sourceIp                = "$context.identity.sourceIp"
                  - status                  = "$context.status"
                }
            ) -> null
        }

      - default_route_settings {
          - data_trace_enabled       = false -> null
          - detailed_metrics_enabled = false -> null
          - throttling_burst_limit   = 0 -> null
          - throttling_rate_limit    = 0 -> null
        }
    }

  # aws_cloudwatch_log_group.api_gw will be destroyed
  - resource "aws_cloudwatch_log_group" "api_gw" {
      - arn               = "arn:aws:logs:us-east-1:183400094533:log-group:/aws/api_gw/serverless_lambda_gw" -> null
      - id                = "/aws/api_gw/serverless_lambda_gw" -> null
      - name              = "/aws/api_gw/serverless_lambda_gw" -> null
      - retention_in_days = 30 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_cloudwatch_log_group.cloudwatch_log_group will be destroyed
  - resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      - arn               = "arn:aws:logs:us-east-1:183400094533:log-group:/aws/lambda/test_task_lambda_function" -> null
      - id                = "/aws/lambda/test_task_lambda_function" -> null
      - name              = "/aws/lambda/test_task_lambda_function" -> null
      - retention_in_days = 30 -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
    }

  # aws_iam_role.lambda_exec will be destroyed
  - resource "aws_iam_role" "lambda_exec" {
      - arn                   = "arn:aws:iam::183400094533:role/serverless_lambda" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-08-11T19:51:26Z" -> null
      - force_detach_policies = false -> null
      - id                    = "serverless_lambda" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "serverless_lambda" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROASVM37LNC7GI7MTSKN" -> null

      - inline_policy {}
    }

  # aws_iam_role_policy_attachment.lambda_policy will be destroyed
  - resource "aws_iam_role_policy_attachment" "lambda_policy" {
      - id         = "serverless_lambda-20210811195126450100000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "serverless_lambda" -> null
    }

  # aws_lambda_function.lambda_function will be destroyed
  - resource "aws_lambda_function" "lambda_function" {
      - arn                            = "arn:aws:lambda:us-east-1:183400094533:function:test_task_lambda_function" -> null
      - function_name                  = "test_task_lambda_function" -> null
      - handler                        = "index.handler" -> null
      - id                             = "test_task_lambda_function" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:183400094533:function:test_task_lambda_function/invocations" -> null
      - last_modified                  = "2021-08-11T19:51:40.084+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-1:183400094533:function:test_task_lambda_function:$LATEST" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::183400094533:role/serverless_lambda" -> null
      - runtime                        = "nodejs12.x" -> null
      - s3_bucket                      = "random-prefix-amazingly-amazingly-big-terrapin" -> null
      - s3_key                         = "lambda_source_code.zip" -> null
      - source_code_hash               = "TY7zJrFF84p4w66nD6z/omFX91U/SqojWk23KCbalvE=" -> null
      - source_code_size               = 411 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # aws_lambda_permission.api_gw will be destroyed
  - resource "aws_lambda_permission" "api_gw" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "test_task_lambda_function" -> null
      - id            = "AllowExecutionFromAPIGateway" -> null
      - principal     = "apigateway.amazonaws.com" -> null
      - source_arn    = "arn:aws:execute-api:us-east-1:183400094533:n1kkxr4nxe/*/*" -> null
      - statement_id  = "AllowExecutionFromAPIGateway" -> null
    }

  # aws_s3_bucket.lambda_source_bucket will be destroyed
  - resource "aws_s3_bucket" "lambda_source_bucket" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::random-prefix-amazingly-amazingly-big-terrapin" -> null
      - bucket                      = "random-prefix-amazingly-amazingly-big-terrapin" -> null
      - bucket_domain_name          = "random-prefix-amazingly-amazingly-big-terrapin.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "random-prefix-amazingly-amazingly-big-terrapin.s3.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "random-prefix-amazingly-amazingly-big-terrapin" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_object.lambda_source_bucket_object will be destroyed
  - resource "aws_s3_bucket_object" "lambda_source_bucket_object" {
      - acl                = "private" -> null
      - bucket             = "random-prefix-amazingly-amazingly-big-terrapin" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "22f6181f902aaf61176154cb4f285b52" -> null
      - force_destroy      = false -> null
      - id                 = "lambda_source_code.zip" -> null
      - key                = "lambda_source_code.zip" -> null
      - metadata           = {} -> null
      - source             = "./lambda_source_code.zip" -> null
      - storage_class      = "STANDARD" -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
    }

  # random_pet.lambda_bucket_name will be destroyed
  - resource "random_pet" "lambda_bucket_name" {
      - id        = "random-prefix-amazingly-amazingly-big-terrapin" -> null
      - length    = 4 -> null
      - prefix    = "random-prefix" -> null
      - separator = "-" -> null
    }

  # module.lambda_with_api_gw_module.aws_apigatewayv2_api.lambda will be created
  + resource "aws_apigatewayv2_api" "lambda" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "serverless_lambda_gw"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.lambda_with_api_gw_module.aws_apigatewayv2_integration.api_gw_integration will be created
  + resource "aws_apigatewayv2_integration" "api_gw_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.lambda_with_api_gw_module.aws_apigatewayv2_route.get_route will be created
  + resource "aws_apigatewayv2_route" "get_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /api"
      + target             = (known after apply)
    }

  # module.lambda_with_api_gw_module.aws_apigatewayv2_route.post_route will be created
  + resource "aws_apigatewayv2_route" "post_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /api"
      + target             = (known after apply)
    }

  # module.lambda_with_api_gw_module.aws_apigatewayv2_stage.lambda will be created
  + resource "aws_apigatewayv2_stage" "lambda" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "serverless_lambda_stage"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.lambda_with_api_gw_module.aws_cloudwatch_log_group.api_gw will be created
  + resource "aws_cloudwatch_log_group" "api_gw" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gw/serverless_lambda_gw"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.lambda_with_api_gw_module.aws_cloudwatch_log_group.cloudwatch_log_group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/test_task_lambda_function"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # module.lambda_with_api_gw_module.aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless_lambda"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.lambda_with_api_gw_module.aws_iam_role_policy_attachment.lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "serverless_lambda"
    }

  # module.lambda_with_api_gw_module.aws_lambda_function.lambda_function will be created
  + resource "aws_lambda_function" "lambda_function" {
      + arn                            = (known after apply)
      + function_name                  = "test_task_lambda_function"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + s3_bucket                      = (known after apply)
      + s3_key                         = "lambda_source_code.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "TY7zJrFF84p4w66nD6z/omFX91U/SqojWk23KCbalvE="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.lambda_with_api_gw_module.aws_lambda_permission.api_gw will be created
  + resource "aws_lambda_permission" "api_gw" {
      + action        = "lambda:InvokeFunction"
      + function_name = "test_task_lambda_function"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # module.lambda_with_api_gw_module.aws_s3_bucket.lambda_source_bucket will be created
  + resource "aws_s3_bucket" "lambda_source_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.lambda_with_api_gw_module.aws_s3_bucket_object.lambda_source_bucket_object will be created
  + resource "aws_s3_bucket_object" "lambda_source_bucket_object" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "22f6181f902aaf61176154cb4f285b52"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambda_source_code.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "lambda_with_api_gw_module/../lambda_source_code.zip"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.lambda_with_api_gw_module.random_pet.lambda_bucket_name will be created
  + resource "random_pet" "lambda_bucket_name" {
      + id        = (known after apply)
      + length    = 4
      + prefix    = "random-prefix"
      + separator = "-"
    }

Plan: 14 to add, 0 to change, 14 to destroy.

Changes to Outputs:
  ~ api_base_url = "https://n1kkxr4nxe.execute-api.us-east-1.amazonaws.com/serverless_lambda_stage" -> (known after apply)

```
</details>
*Pusher: @KhaireeDemo, Action: `pull_request`*